let skillsLocations = [
  "m/عرض - الاستراتيجية الشخصية.pdf",
  "m/عرض - القبعات الست.pdf",
  "m/عرض - قيادة الأولويات.pdf",
  "m/عرض - معايير فريق العمل.pdf",
  "m/عرض التأثير والإقناع.pdf",
  "m/عرض القيادة الأخلاقية.pdf",
  "m/عرض القيادة الموقفية.pdf",
  "m/عرض برنامج تريز.pdf",
  "m/عرض تقدير الذات.pdf",
  "m/عرض قيادة المشروع.pdf",
  "m/أساسيات فريق العمل .pdf",
  "m/المبادرة لموقف قيادي.pdf",
  "m/قيادة الوقت.pdf",
  "m/مشروعي القيادي.pdf",
  "m/مهارات التواصل.pdf",
  "m/مهارات سكامبر.pdf",
];
let hulasaLocation = [
  "الخلاصات/اعادة اختراع القيادة.pdf",
  "الخلاصات/الاستعداد_الذكي_للمستقبل.pdf",
  "الخلاصات/البديل_الثالث.pdf",
  "الخلاصات/التفكير_الإبداعي.pdf",
  "الخلاصات/الذكاء الوجداني.pdf",
  "الخلاصات/السلطة.pdf",
  "الخلاصات/العظمة.pdf",
  "الخلاصات/القيادة  من  الداخل.pdf",
  "الخلاصات/القيادة في وقت الازمات.pdf",
  "الخلاصات/القيادة وقت الأزمات.pdf",
  "الخلاصات/تعاليم_“بيتر_دراكر”.pdf",
  "الخلاصات/تلخيص-كتاب-21-قانونا-لا-يحمل-الجدل-في-القيادة.pdf",
  "الخلاصات/قوة التغيير.pdf",
  "الخلاصات/قيادة التغيير  خطة عمل من ثمان خطوات.pdf",
  "الخلاصات/كبسولات القيادة.pdf",
  "الخلاصات/من_طالب_إلى_قائد.pdf",
  "الخلاصات/وصفات جاك ويلش للقيادة.pdf",
];
let deuratLocation = [
  "d/أساسيات فريق العمل.pdf",
  "d/المبادرة لموقف قيادي.pdf",
  "d/دورات تدريبيةعرض - الاستراتيجية الشخصية.pdf",
  "d/دورات تدريبيةعرض - القبعات الست.pdf",
  "d/دورات تدريبيةعرض - قيادة الأولويات.pdf",
  "d/دورات تدريبيةعرض - معايير فريق العمل.pdf",
  "d/دورات تدريبيةعرض التأثير والإقناع.pdf",
  "d/دورات تدريبيةعرض القيادة الأخلاقية.pdf",
  "d/دورات تدريبيةعرض القيادة الموقفية.pdf",
  "d/دورات تدريبيةعرض برنامج تريز.pdf",
  "d/دورات تدريبيةعرض تقدير الذات.pdf",
  "d/دورات تدريبيةعرض قيادة المشروع.pdf",
  "d/دورات تدريبيةقيادة الوقت.pdf",
  "d/دورات تدريبيةمشروعي القيادي.pdf",
  "d/دورات تدريبيةمهارات التواصل.pdf",
  "d/دورات تدريبيةمهارات سكامبر.pdf",
];

let kutubLocation = [
  "k/القيادة والجندية في السنة النبوية.pdf",
  "k/القيادة_الإدارية_وإنعكاساتها_على_مردود_وفعالية_العملية_الإدارية.pdf",
  "k/القيادة_الإدارية_ودورها_في_خلق_المناخ_الابتكاري_لدى_العمال.pdf",
  "k/القيادة_الذكية_ومهارات_عمل_الفريق.pdf",
  "k/القيادة_في_القرن_الحادي_والعشرين_ملون_القائد_الفعال_ المؤلف_محمد.pdf",
  "k/القيادة_في_المنشآت_الخيرية_وشواهد_من_السيرة.pdf",
  "k/المستويات_الخمسة_للقيادة_جون_ماكسويل  موقع المكتبة تحميل كتب إلكترونية PDF  www.Maktbah.net (1).pdf",
  "k/المسلمون_من_التبعية_والفتنة_إلى_القيادة_والتمكين.pdf",
  "k/المهارات القيادية وعلاقتها بمستوى الأداء الوظيفي ....pdf",
  "k/النظرة_الإستراتيجية_لدى_القائد_وعلاقتها_بالتغيير_التنظيمي_الناجح.pdf",
  "k/بناء المربي القائد.pdf",
  "k/تعلم القيادة.pdf",
  "k/تفعيل_القيادة_التحويلية_من_خلال_أسلوب_تمكين_العاملين_في_المنطقة.pdf",
  "k/دور_القيادة_في_إدارة_الأزمات_بين_الطرح_النظري_والممارسة_العملية.pdf",
  "k/دور_القيادة_في_التغيير_التنظيمي_دراسة_حالة_تحديث_الإدارة_الجزائرية.pdf",
  "k/روابط لقراءة كتب عن القيادة.docx",
  "k/روح-القيادة-ديباك-شوبرا.pdf",
  "k/سحر القيادة_د.ابراهيم الفقي.pdf",
  "k/فقه الاستراتيجية.pdf",
  "k/فكرة_القيادة_الإدارية_و_تطبيقاتها_في_الفكر_الإسلامي.pdf",
  "k/قوة القيادة في القران الكريم.pdf",
  "k/قيادة الحياة.pdf",
  "k/قيادة فريق العمل .pdf",
  "k/قيادة_الأفراد_حلول_من_الخبراء_لتحديات_يومية.pdf",
  "k/كتاب_قيادة_محمد_صلى_الله_عليه_وسلم.pdf",
  "k/كلنا قادة.pdf",
  "k/لمحات في فن القيادة ج. كورتوا المكتبة نت www.Maktbah.net (1).pdf",
  "k/مبادئ القيادة - أ.د. حسين الزومي (1).pdf",
  "k/مساهمة_أخلاقيات_القيادة_الإدارية.pdf",
  "k/مصطلحات القيادة في القرآن والسنة.pdf",
  "k/مهارات القيادة الفعالة.pdf",
  "k/موسوعة القيادة في الإسلام your_books.pdf",
  "k/نمط_القيادة_الإدارية_وعلاقته_بالتغيير_التنظيمي_دراسة_حالة_مطاحن.pdf",
  "k/21 قانونا لا يقبل الجدل في القيادة.pdf",
  "k/econom02111_علاقة_القيادة_التحويلية.pdf",
  "k/econom02137_فكرة_القيادة_الإدارية.pdf",
  "k/econom03686_أثر_القيادة_التبادلية.pdf",
  "k/econom04377_القيادة_التحويلية_وعلاقتها.pdf",
  "k/econom04379_القيم_الادارية_والمهارات.pdf",
  "k/manage00151_الطريق_الى_القيادة_وتنمية.pdf",
  "k/manage00153_العادات_السبع_للناس.pdf",
  "k/manage00156 العبقرية والإبداع.pdf",
  "k/manage00176_القيادة_في_القرن_الحادي.pdf",
  "k/manage00177_القيادة_المرتكزة_على.pdf",
  "k/manage00494_مبدأ_القيادة_الأكثر.pdf",
  "k/Quraan01971_القيادة_في_ضوء_القرآن.pdf",
  "k/tarbyah00423_القيادة_الشخصية_لعباس.pdf",
  "k/tarbyah01030_القيادة_الأخلاقية_من.pdf",
  "k/tarbyah01594_القيادة_التربوية_واثرها.pdf",
  "k/tarbyah01595_القيادة_التربوية_في.pdf",
  "k/th0881_حول_القيادة_والسلطة_في_التاريخ.pdf",
  "k/دوات_مراقبة_التسيير_لقيادة_استراتيجية_المؤسسة_لوحة_القيادة_المتوازنة.pdf",
  "k/أساسيات القيادة.pdf",
  "k/أكتر من١٠٠فائده في القيادة.pdf",
  "k/أنماط_القيادة_الإدارية_و_تأثيرها.pdf",
  "k/إدارة المشاريع.pdf",
  "k/إدارة الوقت.pdf",
  "k/إعادة إختراع القيادة 1.pdf",
  "k/استراتيجيات_القائد_واستراتيجيات.pdf",
  "k/الاستشراف_النبوي_في_الجانب_السياسي_وأثره_في_تفعيل_التخطيط_الاستراتيجي.pdf",
  "k/التحكم_في_قيادة_المؤسسات_بواسطة_لوحات_القيادة_الإستراتيجية_دراسة.pdf",
  "k/الشورى_من_صحيح_الإمام_مسلم_وتطبيقاتها_في_القيادة.pdf",
  "k/الطريق إلى القيادة.pdf",
  "k/الطريق_إلى_القيادة_و_تنمية_الشخصية.pdf",
  "k/العادة الثامنة.pdf",
  "k/العبقرية والإبداع والقيادة.pdf",
  "k/القائد_مؤهلاته_وصفاتــــه.pdf",
  "k/القائد-الخفي-كن-انت-من-يقود-الحلم-واشل-محمد-نبيل-Maktbah.net_.pdf",
  "k/القادة_في_ضوء_القرآن الكريم.pdf",
  "k/القيادة الأخلاقية من منظور إسلامي.pdf",
  "k/القيادة الإدارية ....pdf",
  "k/القيادة المؤثرة.pdf",
  "k/القيادة في قصة موسى عليه السلام.pdf",
  "k/القيادة والتفكير.pdf",
];
let mekatiLocation = [];
let categoriesNames = [
  "المهارات",
  "الكتب",
  "دورات تدريبية",
  "الخلاصات",
  "المقاطع",
];

let linksContainer = document.querySelectorAll(".side-links")[0];
let categoryContainer = document.querySelectorAll(".navbar")[0];

displayCategories(categoriesNames);
displayItems(skillsLocations);

function displayCategories(categories) {
  for (let i = 0; i < categories.length; i++) {
    let category = document.createElement("a");
    category.classList.add("nav-link");
    if (i == 0) {
      category.classList.add("active-green");
    }
    category.href = "#";
    category.innerHTML = categories[i];
    category.addEventListener("click", function () {
      let current = document.querySelector(".active-green");
      current.classList.remove("active-green");
      this.classList.add("active-green");
      console.log(this.innerText);
      switch (this.innerText) {
        case "المهارات":
          displayItems(skillsLocations);
          break;
        case "الكتب":
          displayItems(kutubLocation);
          break;
        case "دورات تدريبية":
          displayItems(deuratLocation);
          break;
        case "الخلاصات":
          displayItems(hulasaLocation);
          break;
        case "المقاطع":
          displayItems(mekatiLocation);
        default:
          break;
      }
    });
    categoryContainer.appendChild(category);
  }
}

function displayItems(items) {
  linksContainer.innerHTML = "";
  for (let i = 0; i < items.length; i++) {
    let link = document.createElement("a");
    link.classList.add("side-link");
    if (i == 0) {
      link.classList.add("active");
      let pdf = document.querySelector("#player");
      pdf.src = items[i];
    }
    link.href = "#";
    link.innerHTML = items[i].split("/")[1].split(".")[0];
    link.addEventListener("click", function () {
      let current = document.querySelector(".active");
      current.classList.remove("active");
      this.classList.add("active");
      let pdf = document.querySelector("#player");
      pdf.src = items[i];
    });
    linksContainer.appendChild(link);
  }
  console.log(linksContainer.childNodes);
}
